---
type: ISelectionFilter
namespace: Autodesk.Revit.UI.Selection
version: 2024
members: 2
tags: [revit-api, class]
---

# ISelectionFilter

`Autodesk.Revit.UI.Selection.ISelectionFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AllowElement | — | `bool AllowElement ( Element elem )` |
| Method | AllowReference | — | `bool AllowReference ( Reference reference , XYZ position )` |